"""
This file contains minor decorative functions like loading animation and other stuff
Delete/Modify it if u want to, idc
"""

#Imports
from time import sleep
from colorama import Fore
from random import choice

def loading() -> None:
    print("Delaying", end='')
    for _ in range(3):
        sleep(.5)
        print('.', end='')
        print('', flush=True, end='')
    print('')

#Logo shuffler
def logo() -> None:
            logos = [
                    r"""
                     /$$$$$$$            /$$$$$$$                        /$$                         
                    | $$__  $$          | $$__  $$                      | $$                         
                    | $$  \ $$ /$$   /$$| $$  \ $$ /$$   /$$  /$$$$$$$ /$$$$$$    /$$$$$$   /$$$$$$  
                    | $$$$$$$/| $$  | $$| $$$$$$$ | $$  | $$ /$$_____/|_  $$_/   /$$__  $$ /$$__  $$ 
                    | $$____/ | $$  | $$| $$__  $$| $$  | $$|  $$$$$$   | $$    | $$$$$$$$| $$  \__/ 
                    | $$      | $$  | $$| $$  \ $$| $$  | $$ \____  $$  | $$ /$$| $$_____/| $$       
                    | $$      |  $$$$$$$| $$$$$$$/|  $$$$$$/ /$$$$$$$/  |  $$$$/|  $$$$$$$| $$       
                    |__/       \____  $$|_______/  \______/ |_______/    \___/   \_______/|__/       
                                /$$  | $$|                                                            
                                |  $$$$$$/                                                            
                                \______/                                                              """,
                    r"""
                    __________        __________                __                
                    \______   \___.__.\______   \__ __  _______/  |_  ___________ 
                    |     ___<   |  | |    |  _/  |  \/  ___/\   __\/ __ \_  __ \
                    |    |    \___  | |    |   \  |  /\___ \  |  | \  ___/|  | \/
                    |____|    / ____| |______  /____//____  > |__|  \___  >__|   
                            \/             \/           \/            \/       
                    """,
                    r"""
                    ░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓███████▓▒░▒▓████████▓▒░▒▓████████▓▒░▒▓███████▓▒░  
                    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░         ░▒▓█▓▒░   ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ 
                    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░         ░▒▓█▓▒░   ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ 
                    ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░   ░▒▓█▓▒░   ░▒▓██████▓▒░ ░▒▓███████▓▒░  
                    ░▒▓█▓▒░         ░▒▓█▓▒░   ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░  ░▒▓█▓▒░   ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ 
                    ░▒▓█▓▒░         ░▒▓█▓▒░   ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░  ░▒▓█▓▒░   ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ 
                    ░▒▓█▓▒░         ░▒▓█▓▒░   ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓███████▓▒░   ░▒▓█▓▒░   ░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░ 
                                                                                                          
                                                                                                          
                    """
            ]
            print(Fore.GREEN + choice(logos) + Fore.RESET)
            
class container():
    def domain_extensions():
        return (
                "com",
                "org",
                "net",
                "info",
                "biz",
                "gov",
                "edu",
                "mil",
                "int",
                "io",
                "co",
                "us",
                "uk",
                "de",
                "jp",
                "cn",
                "ru",
                "fr",
                "ca",
                "au",
                "in",
                "br",
                "za",
                "nl",
                "se",
                "no",
                "dk",
                "fi",
                "es",
                "it",
                "ch",
                "be",
                "at",
                "pl",
                "mx",
                "ar",
                "tr",
                "kr",
                "hk",
                "sg",
                "nz",
                "ie",
                "pt",
                "gr",
                "cz",
                "hu",
                "ro",
                "sk",
                "si",
                "lt",
                "lv",
                "ee",
                "is",
                "my",
                "ph",
                "th",
                "vn",
                "id",
                "sa",
                "ae",
                "il",
                "eg",
                "pk",
                "bd",
                "ng",
                "ke",
                "tz",
                "ua",
                "by",
                "kz",
                "az",
                "ge",
                "eu",
                "shop",
                "blog",
                "online",
                "site",
                "tech",
                "store",
                "app",
                "dev",
                "name",
                "mobi",
                "pro",
                "tv",
                "me",
                "io",
                "xyz",
                "club",
                "space",
                "art",
                "design",
                "agency",
                "company",
                "services",
                "photography",
                "news",
                "social",
                "live",
                "life",
                "bank",
                "insurance",
                "law",
                "health",
                "education",
                "academy",
                "recipes",
                "travel",
                "vacations",
                "rentals",
                "wiki",
                "cloud",
                "studio",
                "solutions",
                "systems",
                "consulting",
                "google"
                )
    